"""
                    ЗАДАЧА 1
1. Перепешите вызов функции merge_lists_to_dict из предыдущей задачи
так, чтобы в нём использовались аргументы с ключевыми словами

2. Добавьте ещё один вызов функции, в котором будет один позиционный аргумент, 
а второй - аргумент с ключевым словом

                    ЗАДАЧА 2
1. Создайте фукнцию update_car_info, в которой все
именованые аргументы будут объединятся в словарь car

2. Добавьте в словарь новый ключь is_available c 
значением True

3. Верните из функции измененный словарь

4. Вызовите функцию с именоваными аргументами
brand и price, их значения могут быть любыми

5. Выведете в терминал результат функции
"""