"""
            ЗАДАЧА 1
1. Создате функцию dict_to_list, которая 
будет конвертировать словарь в список
котрежей
2. Функция должна принимать словарь, а
возвращать список кортежей, вкаждом
кортеже дожны быть пары (key, value) из
словаря
3. Если значение ключа - целове число, то его
нужно умножить на 2 перед добавлением в 
кортеж

            ЗАДАЧА 2
1. Создайте функцию filter_list, которая будет
фильтровать список
2. У функции должно быть два параметра - список и
тип значения
3. Функция должна вернуть новый список, в котором
останутся только значения того типа, который был передан в 
вызове функции вторым аргументом
4. Функцию можно будет вызвать например так:
filter_list([35, True, 'abc', 10], int) и получить [35, 10]
"""
