# Сначала вычисляется сумма,
# затем она передается в функцию печати
print(3 + 4)


   # - — вычитание
   # * — умножение
   # ** — возведение в степень
   # / — деление
   # // — целочисленное деление
   # % — остаток от деления

# Теперь выведем на экран результат деления, а потом результат возведения в степень:

print(8 / 2)   # => 4.0 (При делении двух чисел получается тип данных float)
print(3 ** 2)  # => 9

#print('Задание')

#print('Выведите на экран результат деления числа 81 на 9.')

print('81 / 9 = ', 81//9)