"""
Задание 1  

1. Создайте список с 5 элементов разных типов
2. Удалите 3 элемент
3. Выведете в терминал длинну списка
4. Поменяйте порядок следования элементов в списке
5. Создайте еще один список с двумя элементами
6. Расширьте первый список элементов второго списка
7. Выведете в терминал расширеный список из 6 элементов

Задание 2

1. Создайте два списка
2. Объедените два списка, используя оператор +
3. Определите, какой мигический метод списков вызывается при использовании оператора +
4. Выполните слияние списков, использование этот магический метод
5. Результат выведете в терминал

"""